galeorhinus/projects/bed-controller-idf/sdkconfig.defaults
CONFIG_HTTPD_MAX_REQ_HDR_LEN=2048
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
# CONFIG_PARTITION_TABLE_SINGLE_APP is not set
# CONFIG_PARTITION_TABLE_TWO_OTA is not set
# CONFIG_ESPTOOLPY_FLASHSIZE_1MB is not set
# CONFIG_ESPTOOLPY_FLASHSIZE_2MB is not set
# CONFIG_ESPTOOLPY_FLASHSIZE_4MB is not set
# CONFIG_ESPTOOLPY_FLASHSIZE_8MB is not set
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
# CONFIG_ESPTOOLPY_FLASHSIZE_32MB is not set
# CONFIG_ESPTOOLPY_FLASHSIZE_64MB is not set
# CONFIG_ESPTOOLPY_FLASHSIZE_128MB is not set
CONFIG_HTTPD_MAX_URI_LEN=1024
# App feature toggles
CONFIG_APP_ENABLE_MATTER=n

# Enable BLE (NimBLE) for Matter commissioning
CONFIG_BT_ENABLED=y
CONFIG_BT_BLE_ENABLED=y
# CONFIG_BT_CLASSIC_ENABLED is not set
CONFIG_BT_NIMBLE_ENABLED=y
# CONFIG_BT_BLUEDROID_ENABLED is not set
CONFIG_BT_CTRL_MODE_BLE_ONLY=y

# Prefer smaller binary
CONFIG_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_COMPILER_LTO=y
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"
#CONFIG_IDF_TARGET="esp32"
